tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Modern replacement for 'ls'
brew "exa"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Cross-platform application and UI framework
brew "qt@5"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing", restart_service: true
# Lightweight BitTorrent client
brew "transmission-cli"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# AirPods companion app
cask "airbuddy"
# Enable Windows-like alt-tab
cask "alt-tab"
# Manage team projects and tasks
cask "asana"
# Menu bar icon organizer
cask "bartender"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Downloads videos from different websites
cask "downie"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Productivity app
cask "dropzone"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Collaborative team software
cask "figma"
# Git client focusing on productivity
cask "gitkraken"
# Open-source video transcoder
cask "handbrake"
# Cable-free audio router
cask "loopback"
# Track and update to the latest versions of installed software
cask "macupdater"
# Utility to move and zoom windows—on one display
cask "moom"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Retro video game emulation
cask "openemu"
# Converts and edits video, audio or image files
cask "permute"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Batch file renamer application
cask "renamer"
# Team communication and collaboration software
cask "slack"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Messaging app with a focus on speed and security
cask "telegram"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Cardhop", id: 1290358394
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "Day One", id: 1055511498
mas "DigiDoc4 Client", id: 1370791134
mas "Dropover", id: 1355679052
mas "Fantastical", id: 975937182
mas "Final Cut Pro", id: 424389933
mas "GoodNotes", id: 1444383602
mas "iNet Network Scanner", id: 403304796
mas "Keynote", id: 409183694
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pastebot", id: 1179623856
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "Tot", id: 1491071483
mas "Web eID", id: 1576665083
mas "Xcode", id: 497799835
